### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_container_registry.this will be created
+   resource "azurerm_container_registry" "this" {
+       admin_enabled                 = false
+       admin_password                = (sensitive value)
+       admin_username                = (known after apply)
+       encryption                    = (known after apply)
+       export_policy_enabled         = true
+       id                            = (known after apply)
+       location                      = "uksouth"
+       login_server                  = (known after apply)
+       name                          = "statjavadev88y88"
+       network_rule_bypass_option    = "AzureServices"
+       network_rule_set              = (known after apply)
+       public_network_access_enabled = true
+       resource_group_name           = "rg-static-java-dev-main"
+       retention_policy              = (known after apply)
+       sku                           = "Basic"
+       trust_policy                  = (known after apply)
+       zone_redundancy_enabled       = false
    }

  # azurerm_network_security_group.this will be created
+   resource "azurerm_network_security_group" "this" {
+       id                  = (known after apply)
+       location            = "uksouth"
+       name                = "nsg-java-dev-main"
+       resource_group_name = "rg-static-java-dev-main"
+       security_rule       = (known after apply)
    }

  # azurerm_network_security_rule.this["basic-rule"] will be created
+   resource "azurerm_network_security_rule" "this" {
+       access                      = "Allow"
+       destination_address_prefix  = "10.20.0.0/24"
+       destination_port_range      = "80"
+       direction                   = "Inbound"
+       id                          = (known after apply)
+       name                        = "basic-rule"
+       network_security_group_name = "nsg-java-dev-main"
+       priority                    = 100
+       protocol                    = "Tcp"
+       resource_group_name         = "rg-static-java-dev-main"
+       source_address_prefix       = "*"
+       source_port_range           = "*"
    }

  # azurerm_resource_group.this will be created
+   resource "azurerm_resource_group" "this" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = "rg-static-java-dev-main"
    }

  # azurerm_subnet.subnets["default"] will be created
+   resource "azurerm_subnet" "subnets" {
+       address_prefixes                               = [
+           "10.20.0.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "snet-default"
+       private_endpoint_network_policies              = (known after apply)
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "rg-static-java-dev-main"
+       virtual_network_name                           = "vnet-java-dev-main"
    }

  # azurerm_subnet_network_security_group_association.this["default"] will be created
+   resource "azurerm_subnet_network_security_group_association" "this" {
+       id                        = (known after apply)
+       network_security_group_id = (known after apply)
+       subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.this will be created
+   resource "azurerm_virtual_network" "this" {
+       address_space       = [
+           "10.20.0.0/16",
        ]
+       dns_servers         = (known after apply)
+       guid                = (known after apply)
+       id                  = (known after apply)
+       location            = "uksouth"
+       name                = "vnet-java-dev-main"
+       resource_group_name = "rg-static-java-dev-main"
+       subnet              = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```
</details>